content/blog/modern_internet.md
+++
title = "Can We Go Back To A Better Internet?"
author = ["santi"]
date = 2020-08-06
draft = true
weight = 1012
summary = "Writing hugo post in Emacs org."
+++

In open-source software there's the idea of rollback version, this means that if you use a particular software and the developers make version 2.0 you have the choice to go back to version 1.0 if you want to.

Imagine what it would be like if we could do that with the internet as a whole. I'm talking about a point in time where you could watch a video online without being advertised and click-baited every 5 seconds.


## Internet Version 1.0 {#internet-version-1-dot-0}

Internet v.10 consist of a time where you could search for something online without ending up with the feeling that you are doing everything wrong,\* and that your life we'll forever be a mess if you don't get a personal coach.

**What if we went back to this Internet version 1.0, would that make a better world?**

I'm not sure, it wouldn't allow so many people to seek independance by starting their online businesses. The Internet back there wasn't the interconnected web of knowledge that now is.

Perhaps the lack of mentally destructive social media is the best feature of version 1.0


## Internet Version 2.0 {#internet-version-2-dot-0}

Version 2.0 is a money making machine, if you want to find blogs that are made for the love of knowledge and sharing thoughts, you might have to make your way to the depths of the Internet, in order to find something great. **Most online content is made with the intention to be monetized.**


## What Can We Do About It? {#what-can-we-do-about-it}

I am no exception to some inherent parts of version 2.0. I want to share what I create, **I want to help people who are interested in the same things as I am, and I want to be more independent.**

Creating content online and finding an ethical way to monetize it, is a great feature to empower people to create. Unfortunately there's a lot of ways in which this can go wrong.


## We Can't Go Back To Version 1.0, So What Can We Do? {#we-can-t-go-back-to-version-1-dot-0-so-what-can-we-do}

Perhaps we'll never be able to roll-back to version 1.0, so we might as well talk about how to improve our use of version 2.0

This is something that I'm still trying to find out, some of the questions that content creators must as are:


## Questions For Creators {#questions-for-creators}

-   How can I build a brand founded on trust?
-   How can I be more authentic with my work?
-   If I want to make a living out of this, how can I make it in an ethical way?


## Questions Consuming Online Content {#questions-consuming-online-content}

-   Am I getting value from the content I consume online?
-   Is the Internet helping me achieve what I want, or is it distracting me too much?
-   Do I feel empowered by my use of the Internet, or am I constantly feeling inadequate?

Only by asking better questions can we merge version 1.0 and 2.0 together, into something that benefits as, both as creators and learners.


## Inspiration For This Post {#inspiration-for-this-post}

I was going through [Tania Rascia's](https://www.taniarascia.com/another-website-redesign/) amazing blog and I came across [this blogpost](https://www.taniarascia.com/another-website-redesign/) in it she talks about how the old Internet used to be. She also talks about delivering free content without ads to an audience, just because she loves to create.

I think here philosophy on content creation is admirable, a lot of her content is on web-development and programming, if you are interested in that kind of awesome stuff, I highly recommend [checking out her website.](https://www.taniarascia.com/another-website-redesign/)
